# !/usr/bin/python
# -*- coding: utf-8 -*-
# @time    : 2021/2/29 21:41
# @author  : Mo
# @function: tet csc of token, 简体中文拼写纠错(支持各领域纠错, 泛化性强, 包括古文)


import os
os.environ["MACRO_CORRECT_FLAG_CSC_TOKEN"] = "1"

from macro_correct.pytorch_textcorrection.tcTools import cut_sent_by_stay
from macro_correct import correct_basic
from macro_correct import correct_long
from macro_correct import correct


### 默认纠错(list输入)
text_list = ["一个分知,陌光回聚,莪受打去,祢爱带馀",
             "馀额还有100w",
             "放在陌光下",
             "真麻烦你了。希望你们好好的跳无",
             "少先队员因该为老人让坐",
             "机七学习是人工智能领遇最能体现智能的一个分知",
             "一只小鱼船浮在平净的河面上"
             ]
text_csc = correct(text_list)
print("默认纠错(list输入):")
for res_i in text_csc:
    print(res_i)
print("#" * 128)


### 默认纠错(list输入, 参数配置)
params = {
    "threshold": 0.6,  # token阈值过滤
    "batch_size": 32,  # 批大小
    "max_len": 128,  # 自定义的长度, 如果截断了, 则截断部分不参与纠错, 后续直接一模一样的补回来
    "rounded": 4,  # 保存4位小数
    "flag_confusion": True,  # 是否使用默认的混淆词典
    "flag_prob": True,  # 是否返回纠错token处的概率
}
text_csc = correct(text_list, **params)
print("默认纠错(list输入, 参数配置):")
for res_i in text_csc:
    print(res_i)
print("#" * 128)


### 基础纠错(不包括后处理和过滤)
text_list = ["真麻烦你了。希望你们好好的跳无",
             "少先队员因该为老人让坐",
             "机七学习是人工智能领遇最能体现智能的一个分知",
             "一只小鱼船浮在平净的河面上"
             ]
text_csc = correct_basic(text_list)
print("基础纠错(不包括后处理和过滤):")
for res_i in text_csc:
    print(res_i)
print("#" * 128)


### 长句纠错(默认切句)
text = "真麻烦你了。希望你们好好的跳无。少先队员因该为老人让坐。机七学习是人工智能领遇最能体现智能的一个分知。一只小鱼船浮在平净的河面上。"
text_csc = correct_long(text)
print("长句纠错(默认切句):")
for res_i in text_csc:
    print(res_i)
print("#" * 128)


"""
默认纠错(list输入):
{'index': 1, 'source': '馀额还有100w', 'target': '余额还有100w', 'errors': [['馀', '余', 0, 1.0]]}
{'index': 2, 'source': '放在陌光下', 'target': '放在阳光下', 'errors': [['陌', '阳', 2, 1.0]]}
{'index': 3, 'source': '真麻烦你了。希望你们好好的跳无', 'target': '真麻烦你了。希望你们好好地跳舞', 'errors': [['的', '地', 12, 0.6584], ['无', '舞', 14, 1.0]]}
{'index': 4, 'source': '少先队员因该为老人让坐', 'target': '少先队员应该为老人让坐', 'errors': [['因', '应', 4, 0.995]]}
{'index': 5, 'source': '机七学习是人工智能领遇最能体现智能的一个分知', 'target': '机器学习是人工智能领域最能体现智能的一个分支', 'errors': [['七', '器', 1, 0.9998], ['遇', '域', 10, 0.9999], ['知', '支', 21, 1.0]]}
{'index': 6, 'source': '一只小鱼船浮在平净的河面上', 'target': '一只小鱼船浮在平静的河面上', 'errors': [['净', '静', 8, 0.9961]]}
################################################################################################################################
默认纠错(list输入, 参数配置):
{'index': 1, 'source': '馀额还有100w', 'target': '余额还有100w', 'errors': [['馀', '余', 0, 1.0]]}
{'index': 2, 'source': '放在陌光下', 'target': '放在阳光下', 'errors': [['陌', '阳', 2, 1.0]]}
{'index': 3, 'source': '真麻烦你了。希望你们好好的跳无', 'target': '真麻烦你了。希望你们好好地跳舞', 'errors': [['的', '地', 12, 0.6584], ['无', '舞', 14, 1.0]]}
{'index': 4, 'source': '少先队员因该为老人让坐', 'target': '少先队员应该为老人让坐', 'errors': [['因', '应', 4, 0.995]]}
{'index': 5, 'source': '机七学习是人工智能领遇最能体现智能的一个分知', 'target': '机器学习是人工智能领域最能体现智能的一个分支', 'errors': [['七', '器', 1, 0.9998], ['遇', '域', 10, 0.9999], ['知', '支', 21, 1.0]]}
{'index': 6, 'source': '一只小鱼船浮在平净的河面上', 'target': '一只小鱼船浮在平静的河面上', 'errors': [['净', '静', 8, 0.9961]]}
################################################################################################################################
基础纠错(不包括后处理和过滤):
{'source': '真麻烦你了。希望你们好好的跳无', 'target': '真麻烦你了。希望你们好好地跳舞', 'errors': [['的', '地', 12], ['无', '舞', 14]]}
{'source': '少先队员因该为老人让坐', 'target': '少先队员应该为老人让坐', 'errors': [['因', '应', 4]]}
{'source': '机七学习是人工智能领遇最能体现智能的一个分知', 'target': '机器学习是人工智能领域最能体现智能的一个分支', 'errors': [['七', '器', 1], ['遇', '域', 10], ['知', '支', 21]]}
{'source': '一只小鱼船浮在平净的河面上', 'target': '一只小鱼船浮在平静的河面上', 'errors': [['净', '静', 8]]}
################################################################################################################################
长句纠错(默认切句):
{'index': 1, 'source': '希望你们好好的跳无。', 'target': '希望你们好好的跳舞。', 'errors': [['无', '舞', 14, 1.0]]}
{'index': 2, 'source': '少先队员因该为老人让坐。', 'target': '少先队员应该为老人让坐。', 'errors': [['因', '应', 20, 0.9924]]}
{'index': 3, 'source': '机七学习是人工智能领遇最能体现智能的一个分知。', 'target': '机器学习是人工智能领域最能体现智能的一个分支。', 'errors': [['七', '器', 29, 1.0], ['遇', '域', 38, 1.0], ['知', '支', 49, 1.0]]}
{'index': 4, 'source': '一只小鱼船浮在平净的河面上。', 'target': '一只小鱼船浮在平静的河面上。', 'errors': [['净', '静', 59, 0.9981]]}
################################################################################################################################
"""

